## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/66fc5bcd-5b6f-46c9-8e16-3ed7455ec38e/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_configuration_key.cosmos_endpoint_key will be created
  + resource "azurerm_app_configuration_key" "cosmos_endpoint_key" {
      + configuration_store_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "biotrackr:cosmosdbendpoint"
      + locked                 = false
      + type                   = "kv"
      + value                  = "https://cosmos-biotrackr-prod-ae.documents.azure.com:443/"
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_role_assignment.custom_role will be created
  + resource "azurerm_cosmosdb_sql_role_assignment" "custom_role" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + id                  = (known after apply)
      + name                = (known after apply)
      + principal_id        = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + role_definition_id  = (known after apply)
      + scope               = "cosmos-biotrackr-prod-ae"
    }

  # module.cosmosdb.azurerm_cosmosdb_sql_role_definition.custom_role_definition will be created
  + resource "azurerm_cosmosdb_sql_role_definition" "custom_role_definition" {
      + account_name        = "cosmos-biotrackr-prod-ae"
      + assignable_scopes   = [
          + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae",
        ]
      + id                  = (known after apply)
      + name                = "biotrackr-cosmosdb-role"
      + resource_group_name = "rg-biotrackr-prod-ae"
      + role_definition_id  = (known after apply)
      + type                = "CustomRole"

      + permissions {
          + data_actions = [
              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/*",
              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/*",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_app_configuration_key.cosmos_endpoint_key will be created%0A  + resource "azurerm_app_configuration_key" "cosmos_endpoint_key" {%0A      + configuration_store_id = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.AppConfiguration/configurationStores/appconfig-biotrackr-prod-ae"%0A      + content_type           = (known after apply)%0A      + etag                   = (known after apply)%0A      + id                     = (known after apply)%0A      + key                    = "biotrackr:cosmosdbendpoint"%0A      + locked                 = false%0A      + type                   = "kv"%0A      + value                  = "https://cosmos-biotrackr-prod-ae.documents.azure.com:443/"%0A    }%0A%0A  # module.cosmosdb.azurerm_cosmosdb_sql_role_assignment.custom_role will be created%0A  + resource "azurerm_cosmosdb_sql_role_assignment" "custom_role" {%0A      + account_name        = "cosmos-biotrackr-prod-ae"%0A      + id                  = (known after apply)%0A      + name                = (known after apply)%0A      + principal_id        = "db72fc8d-2c24-4f6c-a64f-0f2331cec9dc"%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + role_definition_id  = (known after apply)%0A      + scope               = "cosmos-biotrackr-prod-ae"%0A    }%0A%0A  # module.cosmosdb.azurerm_cosmosdb_sql_role_definition.custom_role_definition will be created%0A  + resource "azurerm_cosmosdb_sql_role_definition" "custom_role_definition" {%0A      + account_name        = "cosmos-biotrackr-prod-ae"%0A      + assignable_scopes   = [%0A          + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.DocumentDB/databaseAccounts/cosmos-biotrackr-prod-ae",%0A        ]%0A      + id                  = (known after apply)%0A      + name                = "biotrackr-cosmosdb-role"%0A      + resource_group_name = "rg-biotrackr-prod-ae"%0A      + role_definition_id  = (known after apply)%0A      + type                = "CustomRole"%0A%0A      + permissions {%0A          + data_actions = [%0A              + "Microsoft.DocumentDB/databaseAccounts/readMetadata",%0A              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/*",%0A              + "Microsoft.DocumentDB/databaseAccounts/sqlDatabases/containers/items/*",%0A            ]%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>